# yolov8n-wfdm-nowts.yaml
nc: 12 
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]   # 0
  - [-1, 1, Conv, [128, 3, 2]]  # 1
  - [-1, 3, C2f, [128, True]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3
  - [-1, 6, C2f, [256, True]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5
  - [-1, 6, C2f, [512, True]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]    # 9
  
  # --- ROW 4: WFDM (NO WEIGHTS) ---
  # Scaled to 256 specifically for the YOLOv8-Nano architecture
  - [-1, 1, WFDM_NoWts, [256]] # 10 

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11
  - [[-1, 6], 1, Concat, [1]]  # 12 
  - [-1, 3, C2f, [512]]        # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14
  - [[-1, 4], 1, Concat, [1]]  # 15 
  - [-1, 3, C2f, [256]]        # 16 

  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 13], 1, Concat, [1]] # 18 
  - [-1, 3, C2f, [512]]        # 19 

  - [-1, 1, Conv, [512, 3, 2]] # 20
  - [[-1, 10], 1, Concat, [1]] # 21 (Connects to our Wavelet block)
  - [-1, 3, C2f, [1024]]       # 22 

  - [[16, 19, 22], 1, Detect, [nc]]  # 23